#!/bin/bash




echo '------------------------------------------------'
echo -e "任何字符都会原样输出，在其中使用变量是无效的。\n字符串中不能出现单引号，即使对单引号进行转义也不行。"
echo '------------------------------------------------'
echo -e "如果其中包含了某个变量，那么该变量会被解析（得到该变量的值），而不是原样输出。\n字符串中可以出现双引号，只要它被转义了就行。"


echo '------------------------------------------------'
echo -e "不被引号包围的字符串中出现变量时也会被解析，这一点和双引号\" \"包围的字符串一样。\n字符串中不能出现空格，否则空格后边的会作为其他变量或者字符串解析。"

n=74
str1=c.biancheng.net$n 
str2="shell \"script\" $n"
str3='C语言中文网 $n'
echo $str1
echo $str2
echo $str3


echo "\${#string_name}获取字符串长度"

echo ${#str3}









